ESI/hsSphere_rcf/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         3;
        tolerance       1e-09;
        relTol          0.01;
    }

    e
    {
        $U;
        relTol          0.1;
    }
}
/* momentumPredictor           yes; 
nOuterCorrectors            1;
nCorrector                  3;
nNonOrthogonalCorrectors    1;
correctPhi                  no;  */
//oversetAdjustPhi            no;


// ************************************************************************* //
